app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "release_date" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "PG"], ["release_date", "2016-11-18 00:00:00.000000"], ["director", "abc"], ["updated_at", "2018-10-03 23:10:23.745488"], ["id", 1]]

  def samedirector
    @movie = Movie.find(params[:id])
    @director = @movie.director
    if @director.nil? or @director.empty?
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(:director => @director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 9]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "adfa"]]